let arrayData = new Array();
          
// 1 Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.
const arrayABC = ['a', 'b', 'c'];
const array123 = [1,2,3];
arrayData.push(["Дані два масиви: ['a', 'b', 'c'] та [1, 2, 3]. Об'єднайте їх разом.", arrayABC.concat(array123)]);

// 2 Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.
arrayABC.push(1,2,3)
arrayData.push(["Дан масив ['a', 'b', 'c']. Додайте йому до кінця елементи 1, 2, 3.", arrayABC.concat()]);

// 3 Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].
array123.reverse();
arrayData.push(["Дан масив [1, 2, 3]. Зробіть із нього масив [3, 2, 1].", array123.concat()]);

// 4 Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.
array123.reverse().push(4,5,6);
arrayData.push(["Дан масив [1, 2, 3]. Додайте йому до кінця елементи 4, 5, 6.", array123.concat()]);

// 5 Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.
const array123_2 = [1,2,3];
array123_2.unshift(4,5,6);
arrayData.push(["Дан масив [1, 2, 3]. Додайте йому на початок елементи 4, 5, 6.", array123_2.concat()]);

// 6 Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.
const arrayStrings = ['js', 'css', 'jq']
arrayData.push(["Дан масив ['js', 'css', 'jq']. Виведіть перший елемент на екран.", arrayStrings[0]]);

// 7 Дан масив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [1, 2, 3]. ???!!!
let array12345 = [1, 2, 3, 4, 5];
array12345.splice(3,0,1,2,3);
arrayData.push(["Дан масив [1, 2, 3, 4, 5]. За допомогою методу s?lice запишіть нові елементи [1, 2, 3].", array12345.concat()]);

// 8 Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].
array12345 = [1, 2, 3, 4, 5];
array12345.splice(1,2);
arrayData.push(["Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 4, 5].", array12345.concat()]);

// 9 Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].
array12345 = [1, 2, 3, 4, 5];
array12345.splice(2,0,10);
arrayData.push(["Дан масив [1, 2, 3, 4, 5]. За допомогою методу splice перетворіть масив на [1, 2, 10, 3, 4, 5].", array12345.concat()]);

// 10 Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.
const array34127 = [3, 4, 1, 2, 7];
array34127.sort();
arrayData.push(["Дан масив [3, 4, 1, 2, 7]. Відсортуйте його.", array34127.concat()]);

// 11 Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.
const hello = ['Привіт, ', 'світ', '!'];
arrayData.push(["Дан масив з елементами 'Привіт, ', 'світ' і '!'. Потрібно вивести на екран фразу 'Привіт, мир!'.", hello[0].concat(`мир${hello[2]}`)]);

// 12 Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'Поки, ' (тобто замість слова 'Привіт, ' буде 'Поки, ').
hello[0]='До побачення, ';
arrayData.push(["Дан масив ['Привіт, ', 'світ', '!']. Необхідно записати в нульовий елемент цього масиву слово 'До побачення, ' (тобто замість слова 'Привіт, ' буде 'До побачення, ').", hello.join(' ')]);

// 13 Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.
array12345 = new Array(1,2,3,4,5);
array12345 = [];
array12345.push(1);
array12345.push(2);
array12345.push(3);
array12345.push(4);
array12345.push(5);
arrayData.push(["Створіть масив arr з елементами 1, 2, 3, 4, 5 двома різними способами.", array12345.concat()]);

/* 14 
Дан багатовимірний масив arr:
            
                var arr = {
                    'ru':['блакитний', 'червоний', 'зелений'],
                    'en':['blue', 'red', 'green'],
                };
            
        
Виведіть за його допомогою слово 'блакитний' 'blue' .
*/
var arr = {
    'ua':['блакитний', 'червоний', 'зелений'],
    'en':['blue', 'red', 'green'],
};
arrayData.push(["Виведіть за допомогою багатовимірного масиву слово 'блакитний' 'blue' .", `'${arr.ua[0]}' '${arr.en[0]}'`]);

// 15 Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.
const arrayABCD = ['a', 'b', 'c', 'd'];
arrayData.push(["Створіть масив arr = ['a', 'b', 'c', 'd'] і за допомогою його виведіть на екран рядок 'a+b, c+d'.", 
                `${arrayABCD[0]}+${arrayABCD[1]}, ${arrayABCD[2]}+${arrayABCD[3]}`]);


// 16 Запитайте у користувача кількість елементів масиву. Виходячи з даних, які ввів користувач створіть масив на ту кількість елементів, яку передав користувач. у кожному індексі масиву зберігайте чило який показуватиме номер елемента масиву.
const arrLength = parseInt(prompt("Масив на скільки елементів бажаєте?", 7));
const arrayFormUser = new Array(arrLength);
for (let i = 1; i<=arrLength; i++){
    arrayFormUser[i-1] = i;
}
arrayData.push([`Створіть масив на ${arrLength} (це ви ввели) елементів і заповніть його номерами елементів масиву.`, 
                arrayFormUser]);


//17 Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.
let task17='';
for (let i = 0; i < arrayFormUser.length; i++){
    if (arrayFormUser[i] % 2 !== 0) {
        task17 += `<p>${arrayFormUser[i]}</p>`;
    } else {
        task17 += `<span style="background-color:red">${arrayFormUser[i]}</span>`;
    }
}
arrayData.push([`Зробіть так, щоб з масиву, який ви створили вище, вивелися всі непарні числа в параграфі, а парні в спані з червоним тлом.`, 
                task17]);

/*
18
Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.
               
                var vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морковка'];
    
                // Ваш код

                
                document.write(str1); // "Капуста, Ріпа, Редиска, Морквина"
               
*/
let vegetables = ['Капуста', 'Ріпа', 'Редиска', 'Морквина'];
let str1 = '';
vegetables.forEach(myJoin);

function myJoin(word){
    str1+=word + ", ";
}
str1 = str1.slice(0,-2);

arrayData.push([`Напишіть код, який перетворює та об'єднує всі елементи масиву в одне рядкове значення. Елементи масиву будуть розділені комою.`, 
                str1]);

/* the END */

var arrayText = "<table><caption>Working with arrays</caption><thead><tr><th>#</th><th>Task</th><th>Result</th></tr></thead><tbody>";
for(let i = 1; i <= arrayData.length; i++) {
    arrayText += `<tr><td>${i}</td><td>${arrayData[i-1][0]}</td><td>${arrayData[i-1][1]}</td>`;

}
arrayText += "</tbody></table><br/><br/>";

var footer= document.getElementsByTagName("footer")[0];
var text = footer.innerHTML;
var newText = arrayText + text;
footer.innerHTML = newText;
